Using Github Actions to evaluate Flash / RAM size constraints, when using C++ features in ESP-IDF Projects

* Results
** ESP-IDF Version 5.4
*** ESP32S3
| Flag / Feature | D/IRAM | Diff to base |  Flash | Diff to base | Free Heap | Heap + DIRAM |
|----------------+--------+--------------+--------+--------------+-----------+--------------|
| BASE (C)       |  54271 |            0 | 137726 |            0 |    390340 |       444611 |
| <string>       |  54423 |          152 | 144554 |         6828 |    390164 |       444587 |
| <vector>       |  54402 |          131 | 143378 |         5652 |    390164 |       444566 |
| exceptions     |  54575 |          304 | 165494 |        27768 |    390164 |       444739 |
| <iostream>     |  60615 |         6344 | 353858 |       216132 |    383976 |       444591 |
#+TBLFM: $3=$2-@2$2::$5=($4-@2$4)::$7=$2+$6

*** ESP32
| Flag / Feature |  DRAM |  IRAM | Diff to base |  Flash | Diff to base | Free Heap | Heap + DIRAM |
|----------------+-------+-------+--------------+--------+--------------+-----------+--------------|
| BASE (C)       | 11212 | 52186 |            0 | 117202 |            0 |    305356 |       368754 |
| <string>       | 11292 | 52266 |          160 | 123962 |         6760 |    305152 |       368710 |
| <vector>       | 11292 | 52266 |          160 | 122794 |         5592 |    305152 |       368710 |
| <iostream>     | 17412 | 52682 |         6696 | 331422 |       214220 |    298948 |       369042 |
#+TBLFM: $4=($2+$3)-(@2$2+@2$3)::$6=($5-@2$5)::$8=$2+$3+$7
